# Число-паліндром з обох сторін (справа ліворуч і ліворуч) читається однаково.
# Найбільше число-паліндром, одержане множенням двох двозначних чисел: 9009 = 91 × 99.
# Знайдіть найбільший паліндром, одержаний множенням двох трицифрових чисел.
# Виведіть значення цього паліндрому і те, множенням яких чисел він є.

pal_list = []
pal_ab_list = []
for a in range (100, 1000):
    for b in range (100, 1000):
        if str(a*b) == str(a*b)[::-1]:
            pal_list.append(a*b)
            pal_ab_list.append(f'{a}*{b} =')
        else:
            b += 1
d = pal_list.index(max(pal_list))
print(pal_ab_list[d], max(pal_list))
